In [1]:
import pandas as pd 

df = pd.read_csv('red_30_tech_us_sales.csv')

In [2]:
df['OrderTotal'] = df['OrderTotal'].astype(str).str.replace(r'[\s"$#,]', '', regex=True).astype(float)

In [3]:
print(df['OrderTotal'])

0          44.95
1          48.90
2         950.00
3         250.00
4          13.99
          ...
4973       24.95
4974    30960.00
4975      313.09
4976     1285.20
4977     2871.73
Name: OrderTotal, Length: 4978, dtype: float64

In [4]:
df['Price'] = df['Price'].astype(str).str.replace(r'[\s"$#,]', '', regex=True).astype(float)

In [5]:
df['Discount'] = df['Discount'].astype(str).str.replace(r'[\s"$#,]', '', regex=True).astype(float)

In [6]:
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
0,900015476.0,1100948,9/3/2017,Retail,1.0,44.95,0.0,44.95
1,900015476.0,1101096,9/24/2017,Wholesale,10.0,4.99,1.0,48.90
2,900015476.0,1101138,10/1/2017,Wholesale,4.0,250.00,50.0,950.00
3,900015476.0,1101158,10/3/2017,Retail,1.0,250.00,0.0,250.00
4,900015476.0,1101181,10/9/2017,Retail,1.0,13.99,0.0,13.99

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4978 entries, 0 to 4977
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       4977 non-null   float64
 1   OrderNum    4978 non-null   int64
 2   OrderDate   4977 non-null   object
 3   OrderType   4977 non-null   object
 4   Quantity    4976 non-null   float64
 5   Price       4978 non-null   float64
 6   Discount    4978 non-null   float64
 7   OrderTotal  4978 non-null   float64
dtypes: float64(5), int64(1), object(2)
memory usage: 311.3+ KB

In [8]:
df['OrderDate'] = pd.to_datetime(df['OrderDate'], format='%m/%d/%Y')

In [9]:
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
0,900015476.0,1100948,2017-09-03,Retail,1.0,44.95,0.0,44.95
1,900015476.0,1101096,2017-09-24,Wholesale,10.0,4.99,1.0,48.90
2,900015476.0,1101138,2017-10-01,Wholesale,4.0,250.00,50.0,950.00
3,900015476.0,1101158,2017-10-03,Retail,1.0,250.00,0.0,250.00
4,900015476.0,1101181,2017-10-09,Retail,1.0,13.99,0.0,13.99

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4978 entries, 0 to 4977
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       4977 non-null   float64
 1   OrderNum    4978 non-null   int64
 2   OrderDate   4977 non-null   datetime64[ns]
 3   OrderType   4977 non-null   object
 4   Quantity    4976 non-null   float64
 5   Price       4978 non-null   float64
 6   Discount    4978 non-null   float64
 7   OrderTotal  4978 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(1), object(1)
memory usage: 311.3+ KB

In [11]:
df.isnull().any()

EmpID          True
OrderNum      False
OrderDate      True
OrderType      True
Quantity       True
Price         False
Discount      False
OrderTotal    False
dtype: bool

In [14]:
df[df['EmpID'].isnull()]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
598,NaN,1102317,NaT,NaN,NaN,0.0,0.0,0.0

In [15]:
df[df['OrderDate'].isnull()]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
598,NaN,1102317,NaT,NaN,NaN,0.0,0.0,0.0

In [16]:
df[df['OrderType'].isnull()]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
598,NaN,1102317,NaT,NaN,NaN,0.0,0.0,0.0

In [17]:
df[df['Quantity'].isnull()]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal
527,900010405.0,1105103,2019-05-01,Retail,NaN,179.0,0.0,358.0
598,NaN,1102317,NaT,NaN,NaN,0.0,0.0,0.0

In [18]:
df['OrderDate_null'] = df['OrderDate'].isnull()
df.head()

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
0,900015476.0,1100948,2017-09-03,Retail,1.0,44.95,0.0,44.95,False
1,900015476.0,1101096,2017-09-24,Wholesale,10.0,4.99,1.0,48.90,False
2,900015476.0,1101138,2017-10-01,Wholesale,4.0,250.00,50.0,950.00,False
3,900015476.0,1101158,2017-10-03,Retail,1.0,250.00,0.0,250.00,False
4,900015476.0,1101181,2017-10-09,Retail,1.0,13.99,0.0,13.99,False

In [19]:
condition = df['Quantity'].isnull() & (df['OrderDate_null'] == False)
df.loc[condition, 'Quantity'] = (df['OrderTotal'] + df['Discount']) / df['Price']

In [20]:
print(df.loc[527])

EmpID                     900010405.0
OrderNum                      1105103
OrderDate         2019-05-01 00:00:00
OrderType                      Retail
Quantity                          2.0
Price                           179.0
Discount                          0.0
OrderTotal                      358.0
OrderDate_null                  False
Name: 527, dtype: object

In [22]:
df[df.duplicated()]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
13,900015476.0,1101902,2018-01-19,Wholesale,5.0,7.99,1.6,38.35,False
359,900018190.0,1105038,2019-04-20,Retail,1.0,19.99,0.0,19.99,False

In [23]:
df[df['OrderNum'] == 1101902]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
12,900015476.0,1101902,2018-01-19,Wholesale,5.0,7.99,1.6,38.35,False
13,900015476.0,1101902,2018-01-19,Wholesale,5.0,7.99,1.6,38.35,False

In [24]:
df[df['OrderNum'] == 1105038]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
358,900018190.0,1105038,2019-04-20,Retail,1.0,19.99,0.0,19.99,False
359,900018190.0,1105038,2019-04-20,Retail,1.0,19.99,0.0,19.99,False

In [27]:
df_no_dupes = df.drop_duplicates()

In [30]:
df_no_dupes[df_no_dupes['OrderNum'] == 1101902]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
12,900015476.0,1101902,2018-01-19,Wholesale,5.0,7.99,1.6,38.35,False

In [31]:
df_no_dupes[df_no_dupes['OrderNum'] == 1105038]

,EmpID,OrderNum,OrderDate,OrderType,Quantity,Price,Discount,OrderTotal,OrderDate_null
358,900018190.0,1105038,2019-04-20,Retail,1.0,19.99,0.0,19.99,False

In [34]:
df_no_dupes.to_csv('red_30_tech_us_sales_cleaned.csv', index=False)